//1 - Користувач вводить або має два числа. Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

/*let num1 = +prompt('число 1');
let num2 = +prompt('число 2');
if(num1 > num2){
    console.log(num1)
}else if(num1 === num2){
    console.log('рівні числа')
}else {
    console.log(num2)
}*/

//2 - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

/*let mess = prompt('номер квартири');
if (mess >= 1 && mess <= 20) {
    console.log('У першому підїзді');
} else if (mess >= 21 && mess <= 48) {
    console.log('У другому підїзді');
} else if (mess >= 49 && mess <= 90) {
    console.log('У третьому підїзді');
} else {
    console.log('немає такої квартири');
}*/

//3 - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

/*let number = +prompt('число');
if(number === 10){
    console.log('вірно');
}else {
    console.log('нерівно')
}*/

//4 - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
// якщо в змінну записали щось інше, спрацьовує else

// let x = 10;
// let x = '10';
// let x = true;
// let x = [];
// let x = {};
/*if(typeof x === 'number'){
    console.log(1)
}else if(typeof x === 'string'){
    console.log(2)
}else if(typeof x === 'boolean'){
    console.log(3)
}else if(typeof x === 'object' || typeof x === Array){
    console.log(4)
}*/

//5 - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
/*let temp = +prompt('температура');
if(temp >= 10 && temp <= 22){
    console.log('ми йдемо ВЧИТИСЯ');
}else {
    console.log('сидимо вдома і вчимося ОНЛАЙН');
}*/

//6 - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне

/*let victory = +prompt('число від 1 до 5');
switch (victory) {
    case 1:
        console.log('приз - цукерка');
        break;
    case 2:
        console.log('приз - книжка');
        break;
    case 3:
        console.log('приз - телефон');
        break;
    case 4:
        console.log('приз - мото');
        break;
    case 5:
        console.log('приз - авто');
        break;
    default:
        console.log('що число не вірне')
}*/



















