//1 - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

/*let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if(friends.length >= 3){
    console.log('це великий масив, в якому  3 і більше елементи.')
}else {
    console.log(' це маленький масив, в якому менше 3-х елементів.')
}*/

//2 - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

/*let a = 1
let b = 2
let c = 3
if(a > b && a > c){
    console.log('a більше (середнє число)')
}else if (b > a && b > c ){
    console.log('b більше (середнє число)')
}else if (c > b && c > a ){
    console.log('c більше (середнє число)')
}else {
    console.log('числа рівні')
}*/

//3 - Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }

//

/*let result;
console.log(result === a + b < 4 ? 'Мало' : 'Багато');*/


//4  - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
/*let num = +prompt('число');
if(num === 0){
    console.log('нуль');
}else if(num < 0){
    console.log('число негативне');
}else if (num > 0){
    console.log('число позитивне');
}else{
    console.log('не число');
}*/
